Revit 2027 API
PanelScheduleData.GetLoadClassifications Method
 Gets an array of the load classifications associated with this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetLoadClassifications()
Public Function GetLoadClassifications As IList(Of ElementId)
public:
IList<ElementId^>^ GetLoadClassifications()
member GetLoadClassifications : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The array of the load classifications
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace